RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/sec_eng_reg.h
    /* 0x304  reserved */
    uint8_t RESERVED0x304[8];

    /* 0x30C : se_pka_0_seed */
    union {
        struct {
            uint32_t se_pka_0_seed : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_seed;

    /* 0x310 : se_pka_0_ctrl_1 */
    union {
        struct {
            uint32_t se_pka_0_hburst  : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t se_pka_0_hbypass : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31    : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_ctrl_1;

    /* 0x314  reserved */
    uint8_t RESERVED0x314[44];

    /* 0x340 : se_pka_0_rw */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_rw;

    /* 0x344  reserved */
    uint8_t RESERVED0x344[28];

    /* 0x360 : se_pka_0_rw_burst */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_rw_burst;

    /* 0x364  reserved */
    uint8_t RESERVED0x364[152];

    /* 0x3FC : se_pka_0_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_pka_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_pka_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_ctrl_prot;

    /* 0x400 : se_cdet_0_ctrl_0 */
    union {
        struct {
            uint32_t se_cdet_0_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t se_cdet_0_error      : 1;  /* [    1],          r,        0x0 */
            uint32_t se_cdet_0_status     : 14; /* [15: 2],          r,        0x1 */
            uint32_t se_cdet_0_g_loop_max : 8;  /* [23:16],        r/w,       0x64 */
            uint32_t se_cdet_0_g_loop_min : 8;  /* [31:24],        r/w,       0x21 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_0;

    /* 0x404 : se_cdet_0_ctrl_1 */
    union {
        struct {
            uint32_t se_cdet_0_t_loop_n : 8; /* [ 7: 0],        r/w,       0x32 */
            uint32_t se_cdet_0_t_dly_n  : 8; /* [15: 8],        r/w,        0x3 */
            uint32_t se_cdet_0_g_slp_n  : 8; /* [23:16],        r/w,       0xff */
            uint32_t reserved_24_31     : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_1;

    /* 0x408  reserved */
    uint8_t RESERVED0x408[244];

    /* 0x4FC : se_cdet_0_ctrl_prot */
    union {
        struct {
            uint32_t se_cdet_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_cdet_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_cdet_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_prot;

    /* 0x500 : se_gmac_0_ctrl_0 */
    union {
        struct {
            uint32_t se_gmac_0_busy       : 1;  /* [    0],          r,        0x0 */
            uint32_t se_gmac_0_trig_1t    : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_gmac_0_en         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7         : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t se_gmac_0_int        : 1;  /* [    8],          r,        0x0 */
            uint32_t se_gmac_0_int_clr_1t : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_gmac_0_int_set_1t : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_gmac_0_int_mask   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_gmac_0_t_endian   : 1;  /* [   12],        r/w,        0x1 */
            uint32_t se_gmac_0_h_endian   : 1;  /* [   13],        r/w,        0x1 */
            uint32_t se_gmac_0_x_endian   : 1;  /* [   14],        r/w,        0x1 */
            uint32_t reserved_15_31       : 17; /* [31:15],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_ctrl_0;

    /* 0x504 : se_gmac_0_lca */
    union {
        struct {
            uint32_t se_gmac_0_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_lca;

    /* 0x508 : se_gmac_0_status */
    union {
        struct {
            uint32_t se_gmac_0_status : 32; /* [31: 0],          r, 0xf1000000 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_status;

    /* 0x50c  reserved */
    uint8_t RESERVED0x50c[240];

    /* 0x5FC : se_gmac_0_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_gmac_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_gmac_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31  : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_ctrl_prot;

    /* 0x600  reserved */
    uint8_t RESERVED0x600[2304];

    /* 0xF00 : se_ctrl_prot_rd */
    union {
        struct {
            uint32_t se_sha_id0_en_rd  : 1;  /* [    0],          r,        0x1 */
            uint32_t se_sha_id1_en_rd  : 1;  /* [    1],          r,        0x1 */
            uint32_t se_aes_id0_en_rd  : 1;  /* [    2],          r,        0x1 */
            uint32_t se_aes_id1_en_rd  : 1;  /* [    3],          r,        0x1 */
            uint32_t se_trng_id0_en_rd : 1;  /* [    4],          r,        0x1 */
            uint32_t se_trng_id1_en_rd : 1;  /* [    5],          r,        0x1 */
            uint32_t se_pka_id0_en_rd  : 1;  /* [    6],          r,        0x1 */
            uint32_t se_pka_id1_en_rd  : 1;  /* [    7],          r,        0x1 */
            uint32_t se_cdet_id0_en_rd : 1;  /* [    8],          r,        0x1 */
            uint32_t se_cdet_id1_en_rd : 1;  /* [    9],          r,        0x1 */
            uint32_t se_gmac_id0_en_rd : 1;  /* [   10],          r,        0x1 */
            uint32_t se_gmac_id1_en_rd : 1;  /* [   11],          r,        0x1 */
            uint32_t reserved_12_30    : 19; /* [30:12],       rsvd,        0x0 */
            uint32_t se_dbg_dis        : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_prot_rd;

    /* 0xF04 : se_ctrl_reserved_0 */
    union {
        struct {
            uint32_t se_ctrl_reserved_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_0;

    /* 0xF08 : se_ctrl_reserved_1 */
    union {
        struct {
            uint32_t se_ctrl_reserved_1 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_1;

    /* 0xF0C : se_ctrl_reserved_2 */
    union {
        struct {
            uint32_t se_ctrl_reserved_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_2;
};

typedef volatile struct sec_eng_reg sec_eng_reg_t;

#endif /* __SEC_ENG_REG_H__ */
